app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
      render json: Message.all

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 2]]
---
  def show
    message = Message.where(user_id: params[:id])

INSERT INTO "messages" ("chat", "user_id", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chat", "coba berhasil"], ["user_id", 1], ["created_at", "2023-03-08 02:19:48.528973"], ["updated_at", "2023-03-08 02:19:48.528973"], ["image", "Screenshot_from_2023-02-28_16-22-43.png"]]
---
      def create
          msg = Message.new(message_params)
          if msg.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "chat" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["chat", "Test Ganti "], ["updated_at", "2023-03-09 06:06:40.951333"], ["id", 1]]
---
      def update
        msg = Message.find(params[:id])
        if msg.update(message_params)

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 2]]
---
      def destroy
        msg = Message.find(params[:id])
        msg.destroy