app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 359], ["LIMIT", 1]]
---
    def update
        user = User.find(params[:id])