app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        render json: User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: User.find(params[:id])

INSERT INTO "users" ("nama", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nama", "Hasbi"], ["email", "hasbi@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-13 10:12:43.706950"], ["updated_at", "2023-03-13 10:12:43.706950"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."confirm_token" = $1 LIMIT $2  [["confirm_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def confirm_email
        user = User.find_by_confirm_token(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "nama" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["nama", "Ulya"], ["updated_at", "2023-03-09 03:42:34.460444"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
       user = User.find(params[:id])
       user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_user
        @user = User.find(params[:id])